{"pageProps":{"postData":{"id":"looking-forward","contentHtml":"<p>As Pith continues to develop, we're looking forward to what lies ahead in the design and development of the platform. There are a series of exciting phases that we've codified in three planned releases.</p>\n<h2>Alpha stage: October 2020</h2>\n<p>Our primary goal for this release is to have solidified the core discussion mechanisms; the chat and summary. We don't expect to have developed all of the features we'd like to have, but the primary functionality should be implemented.</p>\n<p>Beyond the goal of working discussions, we'd like to begin to develop an audience for the platform. While there's an exciting long-term vision for Pith, in the sort term we need to have a much narrower service proposition: a tool that brings immediate value to those who try it out. For this reason, we're designing an additional feature set for decision making to be included with discussions. The alpha release's value proposition is much more targeted than the final release; it addresses discussions that have the goal of making a decision (a small subset of all discussions and goals that Pith could facilitate in the future.) We hope that a tool like this will provide value to people right away and stir up the sort of conversation we need in order to create a richer discussion experience in the long run.</p>\n<h2>Beta stage: February 2021</h2>\n<p>Early next year we plan to have designed and implemented the most essential state of the between-discussion space. Pith's core vision places discussions in a broader context, where they're situated in a network based on a variety of similarity metrics. While this network is very much a work in progress, it's essential the discussions exist in some kind of a global sphere and can be seen in relation to each other—this space is what provides a novel way to navigate between ideas and identify new links. While we don't expect to have developed the full potential for this network by February, we plan to have implemented it's most essential state—a kind of MVP of the entire system.</p>\n<p>With this new between-discussion space a number of new use cases begin to emerge. Discussions can relate to each other, enabling a level of cross-breeding between ideas that's not possible with isolated discussions. It opens up the utility of Pith to less focused use cases; we foresee this release expanding Pith's audience beyond just individuals to organizations.</p>\n<h2>Launch stage: June 2021</h2>\n<p>After developing the network, it next becomes matter of fleshing out the features needed to create an especially rich and engaging experience on the platform. We expect to have tested and received ample amounts of feedback from the first two releases to guide these design decisions. During this stage, we plan to introduce additional feature sets to discussions beyond just decision making; these might include features for informal social conversation spaces and tools for ideation and brainstorming. The network will continue to be built out, adding in the ability to explore at different resolutions and scales and more advanced transclusion. While this release is least defined, it will include some of the most important changes revealed through testing and work towards making Pith an engaging, rich, and positive environment worth being a part of.</p>\n","title":"Looking Forward","date":"2020-08-05","author":"Christian Broms","summary":"As Pith continues to develop, we're looking forward to what lies ahead in the design and development of the platform. There are a series of exciting phases that we've codified in three planned releases."}},"__N_SSG":true}